Repository: teamvolik/teamvolik
Catalog: src/teamvolik/localization/*/LC_MESSAGES/bot.po
Languages: ru

source: Ok
ru: Ок

source: Yes
ru: Да

source: No
ru: Нет

source: Cancel
ru: Отмена

source: Create a game
ru: Создать игру

source: Sign up for a game
ru: Записаться на игру

source: List of games
ru: Список игр

source: Leave the game
ru: Покинуть игру

source: Welcome to teamvolik bot. First you need to sign up.
ru: Добро пожаловать в бот teamvolik. Сначала вам нужно зарегистрироваться.

source: Do you consent to the storage and processing of personal data (Name and Surname)? This is to facilitate registration for games.
ru: Даете ли вы согласие на хранение и обработку персональных данных (ФИО)? Это сделано для облегчения регистрации в играх.

source: Thanks! We promise to keep your personal data and not distribute it.
ru: Спасибо! Мы обещаем хранить ваши личные данные и не распространять их.

source: Thanks! We respect your personal data and will not store it, but you will have to write your full name each time you register for the game.
ru: Спасибо! Мы уважаем ваши личные данные и не будем их хранить, но вам придется писать свое полное имя каждый раз, когда вы регистрируетесь в игре.

source: Enter full name:
ru: Введите ФИО:

source: You have successfully signed up.
ru: Вы успешно зарегистрированы.

source: Cancel.
ru: Отмена.

source: You do not have permission to execute this command.
ru: У вас нет прав на выполнение данной команды.

source: On what date do you want to open the registration for the game? (DD.MM.YYYY HH:MM)
ru: На какую дату Вы хотите открыть регистрацию на игру? (ДД.ММ.ГГГГ ЧЧ:ММ)

source: Where do you want to play the game?
ru: Где Вы хотите провести игру?

source: Specify the number of players:
ru: Укажите число игроков:

source: Add a description to the game (Leave the field blank if you don't want to add a description):
ru: Добавьте описание к игре (оставьте поле пустым, если не хотите добавлять описание):

source: Is everything right?
ru: Всё верно?

source: The game has been successfully created!
ru: Игра была успешно создана!

source: The game has been cancelled.
ru: Создание игры было отменено.

source: Incorrect date format. Enter the date again. (DD.MM.YYYY HH:MM)
ru: Некорректный формат даты. Введите дату еще раз. (ДД.ММ.ГГГГ ЧЧ:ММ)

source: Incorrect number of players, please enter the number of players again:
ru: Некорректное количество игроков, попробуйте еще раз:

source: Choose one game from the list:
ru: Выберите игру из списка:

source: You have successfully registered for the game.
ru: Вы успешно зарегистрированы на игру.

source: Unfortunately, there are no more places left for this game. Try signing up for another one.
ru: К сожалению, в данной игре больше нет свободных мест, попробуйте зарегистрироваться на другую игру.

source: Unfortunately, there are no more places left for this game. Do you want to reserve?
ru: К сожалению, в данной игре больше нет свободных мест. Хотите зарезервировать место?

source: Game selection successfully deselected.
ru: Выбор игры успешно отменен.

source: You were moved from the reserve to the list of active players in one of the games.
ru: Вы были перемещены из списка резерва в список активных игроков в одной из игр.

source: Select a game to see who signed up for it.
ru: Выберите игру, чтобы увидеть кто на неё уже зарегистрирован.

source: List of players for this game:
ru: Список игроков для данной игры:

source: List of players from reserve:
ru: Список резерва:

source: There are currently no games available to sign up for.
ru: В данный момент нет ни одной игры, на которую можно записаться.

source: No one is registered for this game.
ru: На данную игру никто не зарегистрирован.

source: Select the game you want to leave.
ru: Выберите игру, которую хотите покинуть.

source: The game has been successfully abandoned.
ru: Вы успешно покинули игру.

source: Sorry, but you need to register. Click on the button.
ru: Извините, сначала Вам нужно зарегистрироваться. Нажмите на кнопку.

source: Sorry, but you are already registered.
ru: Извините, вы уже зарегистрированы.

source: Full name entered incorrectly, make sure that the entered data is correct (two words are required).
ru: ФИО введено некорректно, попробуйте ещё раз.

source: The date is entered incorrectly, make sure that the entered data is correct (DD.MM.YYYY HH:MM).
ru: Некорректный формат даты. Введите дату еще раз. (ДД.ММ.ГГГГ ЧЧ:ММ)

source: Incorrect number of players entered, check that the entered data is correct (requires a positive number).
ru: Некорректное число игроков, попробуйте ещё раз.

source: Please select the game again.
ru: Пожалуйста, выберите игру ещё раз.

source: Please select one of the buttons.
ru: Пожалуйста, выберите одну из кнопок.
